In [1]:
import pandas as pd

In [2]:
the_akas = '/Users/Rashad/Documents/GitHub/Test Repo/Project 3/Project-3/Data/title-akas-us-only.csv'
akas_df = pd.read_csv(the_akas, low_memory=False)

In [3]:
the_basics = '/Users/Rashad/Documents/GitHub/Test Repo/Project 3/Project-3/Data/title.basics.tsv.gz'
basics_df = pd.read_csv(the_basics, sep='\t', low_memory=False)

In [4]:
the_ratings = '/Users/Rashad/Documents/GitHub/Test Repo/Project 3/Project-3/Data/title.ratings.tsv.gz'
ratings_df = pd.read_csv(the_ratings, sep='\t', low_memory=False)

In [5]:
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [6]:
akas_df.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,\N,imdbDisplay,\N,0
1,tt0000002,7,The Clown and His Dogs,US,\N,\N,literal English title,0
2,tt0000005,10,Blacksmith Scene,US,\N,imdbDisplay,\N,0
3,tt0000005,1,Blacksmithing Scene,US,\N,alternative,\N,0
4,tt0000005,6,Blacksmith Scene #1,US,\N,alternative,\N,0

In [7]:
ratings_df.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1989
1  tt0000002            5.8       265
2  tt0000003            6.5      1850
3  tt0000004            5.5       178
4  tt0000005            6.2      2634

# Movie Title AKA - Filtering\Cleaning

## Replace "\N" with np.nan

In [8]:
#Replacing '\N' values in dataframe with 'np.nan'
akas_df = akas_df.replace({'\\N':'np.nan'})

In [9]:
#Confirming changes.
akas_df.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,np.nan,imdbDisplay,np.nan,0
1,tt0000002,7,The Clown and His Dogs,US,np.nan,np.nan,literal English title,0
2,tt0000005,10,Blacksmith Scene,US,np.nan,imdbDisplay,np.nan,0
3,tt0000005,1,Blacksmithing Scene,US,np.nan,alternative,np.nan,0
4,tt0000005,6,Blacksmith Scene #1,US,np.nan,alternative,np.nan,0

In [10]:
#checking for duplicates
akas_df.duplicated().sum()

0

In [11]:
#checking to make sure 'region' column is US for all rows.
akas_df['region'].value_counts()

US    1452564
Name: region, dtype: int64

# Movie Title Basics - Filtering\Cleaning

## Include only movies that were released in the United States.

In [12]:
# Filter the basics table down to only include the US by using the filter akas dataframe
keepers =basics_df['tconst'].isin(akas_df['titleId'])
keepers

0            True
1            True
2           False
3           False
4            True
            ...
10036507    False
10036508    False
10036509    False
10036510    False
10036511    False
Name: tconst, Length: 10036512, dtype: bool

In [13]:
#Filtering and replacing the dataframe.
basics_df = basics_df[keepers]
basics_df

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"
5,tt0000006,short,Chinese Opium Den,Chinese Opium Den,0,1894,\N,1,Short
6,tt0000007,short,Corbett and Courtney Before the Kinetograph,Corbett and Courtney Before the Kinetograph,0,1894,\N,1,"Short,Sport"
...,...,...,...,...,...,...,...,...,...
10036373,tt9916560,tvMovie,March of Dimes Presents: Once Upon a Dime,March of Dimes Presents: Once Upon a Dime,0,1963,\N,58,Family
10036402,tt9916620,movie,The Copeland Case,The Copeland Case,0,\N,\N,\N,Drama
10036440,tt9916702,short,Loving London: The Playground,Loving London: The Playground,0,\N,\N,\N,"Drama,Short"
10036463,tt9916756,short,Pretty Pretty Black Girl,Pretty Pretty Black Girl,0,2019,\N,\N,Short
10036467,tt9916764,short,38,38,0,2018,\N,\N,Short

In [14]:
#Replacing '\N' values in dataframe with 'np.nan'
basics_df = basics_df.replace({'\\N':'np.nan'})

In [15]:
#confirming changes
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,np.nan,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,np.nan,5,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,np.nan,1,"Comedy,Short"
5,tt0000006,short,Chinese Opium Den,Chinese Opium Den,0,1894,np.nan,1,Short
6,tt0000007,short,Corbett and Courtney Before the Kinetograph,Corbett and Courtney Before the Kinetograph,0,1894,np.nan,1,"Short,Sport"

## Include only movies that were released 2000 - 2021 (include 2000 and 2021)

In [16]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1365742 entries, 0 to 10036467
Data columns (total 9 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   tconst          1365742 non-null  object
 1   titleType       1365742 non-null  object
 2   primaryTitle    1365742 non-null  object
 3   originalTitle   1365742 non-null  object
 4   isAdult         1365742 non-null  object
 5   startYear       1365742 non-null  object
 6   endYear         1365742 non-null  object
 7   runtimeMinutes  1365742 non-null  object
 8   genres          1365742 non-null  object
dtypes: object(9)
memory usage: 104.2+ MB

In [17]:
basics_df["startYear"] = basics_df["startYear"].replace({'np.nan':0})

In [18]:
#changeing datatype of column 'startYear'
basics_df["startYear"] = basics_df["startYear"].astype("int64")

In [19]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1365742 entries, 0 to 10036467
Data columns (total 9 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   tconst          1365742 non-null  object
 1   titleType       1365742 non-null  object
 2   primaryTitle    1365742 non-null  object
 3   originalTitle   1365742 non-null  object
 4   isAdult         1365742 non-null  object
 5   startYear       1365742 non-null  int64
 6   endYear         1365742 non-null  object
 7   runtimeMinutes  1365742 non-null  object
 8   genres          1365742 non-null  object
dtypes: int64(1), object(8)
memory usage: 104.2+ MB

In [20]:
#filtering between years 2000-2021
basics_df = basics_df[(basics_df['startYear'] >= 2000) & (basics_df['startYear'] <= 2021)]

In [21]:
#checking filter changes to dataframe.
basics_df['startYear'].value_counts()

2018    64057
2017    62791
2019    60336
2016    60299
2015    57051
2020    56737
2014    55743
2021    53807
2013    51509
2012    47812
2011    44307
2010    38626
2009    35269
2008    30381
2007    27759
2006    26291
2005    23449
2004    20374
2003    17282
2002    15106
2001    13695
2000    12769
Name: startYear, dtype: int64

## Include only full-length movies (titleType = "movie").

In [22]:
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
33802,tt0034413,short,Youth Gets a Break,Youth Gets a Break,0,2001,np.nan,20,Short
34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,np.nan,118,"Comedy,Fantasy,Romance"
39544,tt0040241,short,Color Rhapsodie,Color Rhapsodie,0,2021,np.nan,6,Short
43546,tt0044326,short,Abstronic,Abstronic,0,2021,np.nan,6,Short
49493,tt0050396,short,Final Curtain,Final Curtain,0,2012,np.nan,20,"Horror,Short"

In [23]:
basics_df.shape

(875450, 9)

In [24]:
basics_df["titleType"] = basics_df["titleType"].astype("str",copy=False)

In [25]:
basics_df = basics_df[basics_df["titleType"] == "movie"]

In [26]:
basics_df.shape

(135095, 9)

In [27]:
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,np.nan,118,"Comedy,Fantasy,Romance"
61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,np.nan,70,Drama
67488,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,np.nan,90,Drama
67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,np.nan,122,Drama
86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,np.nan,100,"Comedy,Horror,Sci-Fi"

## Eliminate movies that are null for runtimeMinutes

In [28]:
#checking count of np.nan (null) values.
basics_df['runtimeMinutes'].value_counts()

np.nan    19164
90         7466
80         3475
85         3275
95         3005
          ...
306           1
316           1
249           1
301           1
218           1
Name: runtimeMinutes, Length: 391, dtype: int64

In [29]:
#checking size of basics dataframe
basics_df.shape

(135095, 9)

In [30]:
#removing rows where runtimeMinutes equals null\np.nan 
basics_df = basics_df[basics_df['runtimeMinutes']!='np.nan']

In [31]:
display(basics_df.head())
print()
print(f"Shape is {basics_df.shape}")

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,np.nan,118,"Comedy,Fantasy,Romance"
61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,np.nan,70,Drama
67488,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,np.nan,90,Drama
67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,np.nan,122,Drama
86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,np.nan,100,"Comedy,Horror,Sci-Fi"

Shape is (115931, 9)

## Eliminate movies that are null for genre

In [32]:
#quick view and count of 'genres' that are null\np.nan
basics_df[basics_df['genres']=='np.nan']

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
132765,tt0136666,movie,Simon Says,Simon Says,0,2000,np.nan,91,np.nan
133209,tt0137140,movie,One Bad Mice,One Bad Mice,0,2009,np.nan,88,np.nan
133861,tt0137818,movie,Housesitter: The Night They Saved Siegfried's ...,Housesitter: The Night They Saved Siegfried's ...,0,2018,np.nan,95,np.nan
151435,tt0156263,movie,The Adventures of Space Baby and Mental Man,The Adventures of Space Baby and Mental Man,0,2004,np.nan,90,np.nan
154238,tt0159230,movie,18 D,18 D,0,2000,np.nan,102,np.nan
...,...,...,...,...,...,...,...,...,...
10000462,tt9838412,movie,Wild Tour,Wairudo tsuâ,0,2019,np.nan,67,np.nan
10000467,tt9838428,movie,Shinjuku Tiger,Shinjuku taigâ,0,2019,np.nan,83,np.nan
10000468,tt9838430,movie,Nunchaku and Soul,Nunchaku souru,0,2019,np.nan,76,np.nan
10000583,tt9838694,movie,The Tristan Project,The Tristan Project,0,2005,np.nan,270,np.nan
10016067,tt9872618,movie,The Happy Prisoner,Kôfuku na shûjin,0,2019,np.nan,108,np.nan

In [33]:
#removing rows where 'genres' equals null\np.nan 
basics_df = basics_df[basics_df['genres']!='np.nan']

In [34]:
display(basics_df.head())
print()
print(f"Shape is {basics_df.shape}")

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,np.nan,118,"Comedy,Fantasy,Romance"
61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,np.nan,70,Drama
67488,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,np.nan,90,Drama
67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,np.nan,122,Drama
86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,np.nan,100,"Comedy,Horror,Sci-Fi"

Shape is (114444, 9)

## Convert the startYear column to float data type.

In [35]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 114444 entries, 34802 to 10036278
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          114444 non-null  object
 1   titleType       114444 non-null  object
 2   primaryTitle    114444 non-null  object
 3   originalTitle   114444 non-null  object
 4   isAdult         114444 non-null  object
 5   startYear       114444 non-null  int64
 6   endYear         114444 non-null  object
 7   runtimeMinutes  114444 non-null  object
 8   genres          114444 non-null  object
dtypes: int64(1), object(8)
memory usage: 8.7+ MB

In [36]:
#changeing datatype of column 'startYear'
basics_df["startYear"] = basics_df["startYear"].astype("float64")

In [37]:
#confirming change of data type
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 114444 entries, 34802 to 10036278
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          114444 non-null  object
 1   titleType       114444 non-null  object
 2   primaryTitle    114444 non-null  object
 3   originalTitle   114444 non-null  object
 4   isAdult         114444 non-null  object
 5   startYear       114444 non-null  float64
 6   endYear         114444 non-null  object
 7   runtimeMinutes  114444 non-null  object
 8   genres          114444 non-null  object
dtypes: float64(1), object(8)
memory usage: 8.7+ MB

## Eliminate movies that include "Documentary" in the genre (see tip below).

In [38]:
#quick view of contents of column 'genres'
basics_df['genres'].value_counts()

Documentary                    20107
Drama                          16146
Comedy                          6736
Comedy,Drama                    3812
Horror                          3743
                               ...
History,Sci-Fi                     1
Biography,War                      1
Comedy,Mystery,Sport               1
Action,Documentary,News            1
Mystery,Reality-TV,Thriller        1
Name: genres, Length: 1040, dtype: int64

---

* You will also want to use the `~` operator to take the inverse of your Trues/Falses.

In [39]:
# Exclude movies that are included in the documentary category.
is_documentary = basics_df['genres'].str.contains('documentary',case=False)
basics_df = basics_df[~is_documentary]

In [40]:
basics_df['genres'].value_counts()

Drama                          16146
Comedy                          6736
Comedy,Drama                    3812
Horror                          3743
Drama,Romance                   2517
                               ...
Action,Crime,Music                 1
Fantasy,Sci-Fi,Western             1
Biography,History,Thriller         1
Action,Animation,Game-Show         1
Mystery,Reality-TV,Thriller        1
Name: genres, Length: 843, dtype: int64

# Movie Title Rating - Filtering\Cleaning

## Keep only movies that were included in your final title basics dataframe above.
* (Use AKAs table, see "Filtering one dataframe based on another" section below)

In [41]:
display( basics_df.head() )
display( basics_df.shape )

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,np.nan,118,"Comedy,Fantasy,Romance"
61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,np.nan,70,Drama
67488,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,np.nan,90,Drama
67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,np.nan,122,Drama
86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,np.nan,100,"Comedy,Horror,Sci-Fi"

(81903, 9)

In [42]:
display( ratings_df.head() )
display( ratings_df.shape )

      tconst  averageRating  numVotes
0  tt0000001            5.7      1989
1  tt0000002            5.8       265
2  tt0000003            6.5      1850
3  tt0000004            5.5       178
4  tt0000005            6.2      2634

(1333263, 3)

In [43]:
new_sort = ratings_df['tconst'].isin( basics_df['tconst'] )

In [44]:
new_sort

0          False
1          False
2          False
3          False
4          False
           ...
1333258    False
1333259    False
1333260    False
1333261    False
1333262    False
Name: tconst, Length: 1333263, dtype: bool

In [45]:
ratings_df = ratings_df[new_sort]

In [46]:
ratings_df

            tconst  averageRating  numVotes
17964    tt0035423            6.4     87192
40768    tt0062336            6.4       175
46491    tt0068865            5.4        75
46649    tt0069049            6.7      7759
63645    tt0088751            5.2       336
...            ...            ...       ...
1333181  tt9914942            6.6       179
1333208  tt9915872            6.4         9
1333221  tt9916170            7.0         7
1333222  tt9916190            3.7       243
1333233  tt9916362            6.4      5437

[68008 rows x 3 columns]

# Final Summary of RATINGS dataframe.

In [47]:
ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 68008 entries, 17964 to 1333233
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         68008 non-null  object
 1   averageRating  68008 non-null  float64
 2   numVotes       68008 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.1+ MB

# Final Summary of BASICS dataframe.

In [48]:
basics_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 81903 entries, 34802 to 10036278
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81903 non-null  object
 1   titleType       81903 non-null  object
 2   primaryTitle    81903 non-null  object
 3   originalTitle   81903 non-null  object
 4   isAdult         81903 non-null  object
 5   startYear       81903 non-null  float64
 6   endYear         81903 non-null  object
 7   runtimeMinutes  81903 non-null  object
 8   genres          81903 non-null  object
dtypes: float64(1), object(8)
memory usage: 6.2+ MB

# Final Summary of AKAS dataframe.

In [49]:
akas_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1452564 entries, 0 to 1452563
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1452564 non-null  object
 1   ordering         1452564 non-null  int64
 2   title            1452564 non-null  object
 3   region           1452564 non-null  object
 4   language         1452564 non-null  object
 5   types            1452564 non-null  object
 6   attributes       1452564 non-null  object
 7   isOriginalTitle  1452564 non-null  object
dtypes: int64(1), object(7)
memory usage: 88.7+ MB

# Saving dataframes as new .CSV files to repo.

In [51]:
#Saving RATINGS dataframe to .csv
ratings_df.to_csv('/Users/Rashad/Documents/GitHub/Test Repo/Project 3/Project-3/Data/Final_RATINGS.csv.gz', compression='gzip', index=False)

In [52]:
#Saving BASICS dataframe to .csv
basics_df.to_csv('/Users/Rashad/Documents/GitHub/Test Repo/Project 3/Project-3/Data/Final_BASICS.csv.gz', compression='gzip', index=False)

In [53]:
#Saving AKAS dataframe to .csv
akas_df.to_csv('/Users/Rashad/Documents/GitHub/Test Repo/Project 3/Project-3/Data/Final_AKAS.csv.gz', compression='gzip', index=False)